---
kind: property
id: P:Autodesk.Revit.DB.Events.ViewPrintedEventArgs.Index
source: html/d1c12c06-38aa-601e-ef19-479a484001cd.htm
---
# Autodesk.Revit.DB.Events.ViewPrintedEventArgs.Index Property

The index of the view being printed out of the set of all views being printed.

## Syntax (C#)
```csharp
public int Index { get; }
```

## Remarks
The index is zero-based. When a single view is being printed, this value should be 0.